/* 멤버의 개념
 * 1. 자바 언어세어의 멤버는 집합(set)과 구성요소 (Field, Method, Class 등)로 나눈다
 * 2. 집합은 클래스들의 묶음으로 이해할 수 있다
 * 3. 구성요소는 클래스 내에 존재할 수 있는 요소들로 이해할 수 있다.
 * 4. 집합과 구성요소는 documentation api를 톻해 확인할 수 있다.
 * 
 * 상수와 변수, 자료형의 개념
 * 컴퓨터로 3+2=5라는 작업을 할 떄 3,2,+,5 를 기억할 수 있는 공간의 개념이 변수
 * 변수는 통이라고 생각하면 되는데 통 안에는 상수가 들어갈 수 있다. 상수라는 것은 위에서 말한 3,2 ... 데이터 그 자체이다. 
 * 상수는 내부적으로 2진 비트의 값을 가지고 있다.
 * 상수는 눈으로 봤을 때 명확한 것,구성한 값을 가지고 있는 것, 변하지 않는 것 항상 동일한 수
 * 상수는 탁구공,야구공,축구공이라 했을 때 변수는 탁구공을 담는 통, 야구공을 담는 통, 축구공을 담는 통
 * 상수변수 : 변수 공간이지만 최초 선언 시 지정한 상수의 값을 프로그램 종료 시까지 유지
 * 자료형 : 상수 값의 크기에 맞게 메모리 상에 할당될 변수의 공간을 지정하는 용도. // 탁구공을 탁구공 통에 담는 등
 * 자료형의 크기가 1,2,4,8 byte로 정해져 있는 통의 크기가 있다
 * 자료형의 범위는 숫자로 표시한다.(bit)
 * bit는 컴퓨터의 가장 원시적인 신호, 최소 단위의 기호. 8 bit=1 byte
 * 1 byte 는 프로그램이 이해하는 최소 단위.
 * 자료형은 부호가 있는 자료형 (-부터 시작해서 +까지 넘어가는 자료형) / 부호가 없는 자료형 ( 0부터 시작해서 양의 수로만 존재하는 자료형. char 자료형이 유일한 부호 없는 자료형)
 * 자료형은 그 범위에서 돌고 돈다
 * 
 *  기본 자료형과 String 클래스
 *  교재 참조
 *  
 */
