
public class LectureNote {

}


//jre는 실행을 위한 내용들만 담고 있다
//jdk는 실행 명령어(컴파일 명령어)등을 담고 있다
//tools. api는 실제로 자바가 동작하기 위한 명령어 군집. 동작을 할 수 있도록 만드는 것들.
//
//3. 자바 가상머신
//자바 클래스 파일의 바이트 코드(자바 프로그램을 만들어서 컴파일 하면 바이트 코드가 나타남)를 읽어서 실행하는 역할 => 인터프리터
//샌드박스 형태로 되어 있어 외부에서 프로그램을 실행하으모 부정하게 조작되는 것을 막음
//우리가 작성한 클래스를 자바 프로그램 실행하면서 읽어들여서 자신의 메모리 상에 배치시킨 다음에 실제 실행 엔진을 가지고 실행하는 구조.
//heap 구조 : young generation / old generation 
//자바의 메모리 상에서 방금 만들어진 것들은 영 제너레이션. 계속 쓸수록 edeon,souuvivor1,souvivor2 d

//실무 프로젝트에서 자바 버젼에 따라 쓸 수 있는 api가 다르므로 참고하여야 한다.

//jar = 자바에서의 압축파일

//상단 툴바의 window - perspective - open perspective - java browsing 자바 개발 인터페이스